cases/Day-1/Part_1.2_tubeConv/0/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        // The pressure BC is calculated based on the velocity BC
        type            fixedFluxPressure;
        gradient        uniform 0;
        value           uniform 0;
    }

    outlet
    {
        // Fix (p-rho*g*h)/rho at tube outlet
        type            fixedValue;
        value           uniform 0;
    }

    wall
    {
        // Default BC for solid boundaries
        type            fixedFluxPressure;
    }
}

// ************************************************************************* //
